performance_ruby_2_2_0/rhebok/pi.txt
[error] socket: read error Connection reset by peer sock.c:479: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:479: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:479: Connection reset by peer
[...]
[alert] socket: 1881786112 select timed out: Connection timed out
[alert] socket: -1859262720 select timed out: Connection timed out
[error] socket: read error Connection reset by peer sock.c:479: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:479: Connection reset by peer
[error] socket: -2085865728 connection timed out.: Connection timed out
[error] socket: -1792121088 connection timed out.: Connection timed out
[error] socket: 2099996416 connection timed out.: Connection timed out
[error] socket: -1674623232 connection timed out.: Connection timed out
[error] socket: -1876048128 connection timed out.: Connection timed out
[error] socket: -1708194048 connection timed out.: Connection timed out
[error] socket: -2035509504 connection timed out.: Connection timed out
[error] socket: -1850870016 connection timed out.: Connection timed out
[error] socket: -1867655424 connection timed out.: Connection timed out
[error] socket: 1940535040 connection timed out.: Connection timed out
[error] socket: -1641052416 connection timed out.: Connection timed out
[error] socket: -1649445120 connection timed out.: Connection timed out
[error] socket: 2125174528 connection timed out.: Connection timed out
[error] socket: 2091603712 connection timed out.: Connection timed out
[error] socket: -1599088896 connection timed out.: Connection timed out
[error] socket: -1733372160 connection timed out.: Connection timed out
[error] socket: -1691408640 connection timed out.: Connection timed out
[error] socket: -1716586752 connection timed out.: Connection timed out
[error] socket: 2141959936 connection timed out.: Connection timed out
[error] socket: -1582303488 connection timed out.: Connection timed out
[error] socket: -1750157568 connection timed out.: Connection timed out
[error] socket: 2049640192 connection timed out.: Connection timed out
[error] socket: -1993545984 connection timed out.: Connection timed out
[error] socket: 1999283968 connection timed out.: Connection timed out
[error] socket: -1808906496 connection timed out.: Connection timed out
[error] socket: 2007676672 connection timed out.: Connection timed out
[error] socket: -1976760576 connection timed out.: Connection timed out
[error] socket: 2066425600 connection timed out.: Connection timed out
[error] socket: -2010331392 connection timed out.: Connection timed out
[error] socket: -1699801344 connection timed out.: Connection timed out
[error] socket: -1867655424 connection timed out.: Connection timed out
[error] socket: 1915356928 connection timed out.: Connection timed out
[alert] socket: 1906964224 select timed out: Connection timed out
[error] socket: -1792121088 connection timed out.: Connection timed out
[error] socket: 2116781824 connection timed out.: Connection timed out
[error] socket: -1766942976 connection timed out.: Connection timed out
[error] socket: -1615874304 connection timed out.: Connection timed out
[error] socket: -1741764864 connection timed out.: Connection timed out
[error] socket: -2043902208 connection timed out.: Connection timed out
[error] socket: -2119436544 connection timed out.: Connection timed out
[error] socket: -1901226240 connection timed out.: Connection timed out
[error] socket: 2108389120 connection timed out.: Connection timed out
[error] socket: -1850870016 connection timed out.: Connection timed out
[error] socket: -1951582464 connection timed out.: Connection timed out
[error] socket: 1915356928 connection timed out.: Connection timed out
[error] socket: -1834084608 connection timed out.: Connection timed out
[error] socket: -2144614656 connection timed out.: Connection timed out
[error] socket: -2001938688 connection timed out.: Connection timed out
[error] socket: -1934797056 connection timed out.: Connection timed out
[error] socket: 1923749632 connection timed out.: Connection timed out
[error] socket: -1926404352 connection timed out.: Connection timed out
[error] socket: -2127829248 connection timed out.: Connection timed out
[error] socket: -1590696192 connection timed out.: Connection timed out
[error] socket: -1733372160 connection timed out.: Connection timed out
[error] socket: -2069080320 connection timed out.: Connection timed out
[error] socket: -2018724096 connection timed out.: Connection timed out
[error] socket: -1976760576 connection timed out.: Connection timed out
[error] socket: -1918011648 connection timed out.: Connection timed out
[error] socket: -1884440832 connection timed out.: Connection timed out
[error] socket: -2119436544 connection timed out.: Connection timed out
[error] socket: -1683015936 connection timed out.: Connection timed out
[error] socket: -2035509504 connection timed out.: Connection timed out
[error] socket: -1800513792 connection timed out.: Connection timed out
[error] socket: 2108389120 connection timed out.: Connection timed out
[error] socket: -1691408640 connection timed out.: Connection timed out
[error] socket: 2125174528 connection timed out.: Connection timed out
[error] socket: 1982498560 connection timed out.: Connection timed out
[error] socket: 1898571520 connection timed out.: Connection timed out
[alert] socket: -2060687616 select timed out: Connection timed out
[error] socket: -1599088896 connection timed out.: Connection timed out
[error] socket: 2058032896 connection timed out.: Connection timed out
[error] socket: -1758550272 connection timed out.: Connection timed out
[error] socket: -2136221952 connection timed out.: Connection timed out
[error] socket: -1951582464 connection timed out.: Connection timed out
[error] socket: -2018724096 connection timed out.: Connection timed out
[error] socket: -2001938688 connection timed out.: Connection timed out
[error] socket: -1657837824 connection timed out.: Connection timed out
[error] socket: -1641052416 connection timed out.: Connection timed out
[error] socket: 2032854784 connection timed out.: Connection timed out
[error] socket: -1892833536 connection timed out.: Connection timed out
[error] socket: -1993545984 connection timed out.: Connection timed out
[error] socket: -1724979456 connection timed out.: Connection timed out
[error] socket: -1842477312 connection timed out.: Connection timed out
[error] socket: -1683015936 connection timed out.: Connection timed out
[error] socket: -1808906496 connection timed out.: Connection timed out
[error] socket: -1590696192 connection timed out.: Connection timed out
[error] socket: -2043902208 connection timed out.: Connection timed out
[error] socket: -1918011648 connection timed out.: Connection timed out
[error] socket: 2041247488 connection timed out.: Connection timed out
[error] socket: -1607481600 connection timed out.: Connection timed out
[error] socket: 1982498560 connection timed out.: Connection timed out
[error] socket: -1926404352 connection timed out.: Connection timed out
[error] socket: 2083211008 connection timed out.: Connection timed out
[error] socket: -2077473024 connection timed out.: Connection timed out
[error] socket: -1909618944 connection timed out.: Connection timed out
[error] socket: 2058032896 connection timed out.: Connection timed out
[error] socket: 2016069376 connection timed out.: Connection timed out
[error] socket: -2144614656 connection timed out.: Connection timed out
[error] socket: -1825691904 connection timed out.: Connection timed out
[error] socket: -2111043840 connection timed out.: Connection timed out
[error] socket: -2035509504 connection timed out.: Connection timed out
[error] socket: -1968367872 connection timed out.: Connection timed out
[error] socket: 2099996416 connection timed out.: Connection timed out
[error] socket: -1766942976 connection timed out.: Connection timed out
[error] socket: 1990891264 connection timed out.: Connection timed out
[error] socket: -2085865728 connection timed out.: Connection timed out
[error] socket: 2141959936 connection timed out.: Connection timed out
[error] socket: 2066425600 connection timed out.: Connection timed out
[error] socket: -1699801344 connection timed out.: Connection timed out
[error] socket: -2010331392 connection timed out.: Connection timed out
[error] socket: -1901226240 connection timed out.: Connection timed out
[error] socket: 1915356928 connection timed out.: Connection timed out
[error] socket: -1951582464 connection timed out.: Connection timed out
[error] socket: -2119436544 connection timed out.: Connection timed out
[error] socket: 1999283968 connection timed out.: Connection timed out
[error] socket: 2125174528 connection timed out.: Connection timed out
[error] socket: -1867655424 connection timed out.: Connection timed out
[error] socket: -1750157568 connection timed out.: Connection timed out
[error] socket: -2077473024 connection timed out.: Connection timed out
[error] socket: -1599088896 connection timed out.: Connection timed out
[error] socket: 2041247488 connection timed out.: Connection timed out
[error] socket: 1957320448 connection timed out.: Connection timed out
[error] socket: -1716586752 connection timed out.: Connection timed out
[error] socket: 1881786112 connection timed out.: Connection timed out
[error] socket: 1990891264 connection timed out.: Connection timed out
[error] socket: -1624267008 connection timed out.: Connection timed out
[error] socket: -2102651136 connection timed out.: Connection timed out
[error] socket: -2052294912 connection timed out.: Connection timed out
[error] socket: -1582303488 connection timed out.: Connection timed out
[error] socket: 2074818304 connection timed out.: Connection timed out
[error] socket: -1918011648 connection timed out.: Connection timed out
[error] socket: 2108389120 connection timed out.: Connection timed out
[error] socket: -2060687616 connection timed out.: Connection timed out
[error] socket: -1783728384 connection timed out.: Connection timed out
[error] socket: 2058032896 connection timed out.: Connection timed out
[error] socket: -1766942976 connection timed out.: Connection timed out
[error] socket: -1792121088 connection timed out.: Connection timed out
[error] socket: -1808906496 connection timed out.: Connection timed out
[error] socket: 2133567232 connection timed out.: Connection timed out
[error] socket: 1965713152 connection timed out.: Connection timed out
[error] socket: -2136221952 connection timed out.: Connection timed out
[alert] socket: 1948927744 select timed out: Connection timed out
[error] socket: -1674623232 connection timed out.: Connection timed out
[error] socket: -1582303488 connection timed out.: Connection timed out
[error] socket: 1906964224 connection timed out.: Connection timed out
[error] socket: -1993545984 connection timed out.: Connection timed out
[error] socket: 1890178816 connection timed out.: Connection timed out
[error] socket: 2041247488 connection timed out.: Connection timed out
[error] socket: -1590696192 connection timed out.: Connection timed out
[error] socket: -1959975168 connection timed out.: Connection timed out
[error] socket: 1957320448 connection timed out.: Connection timed out
[error] socket: -2060687616 connection timed out.: Connection timed out
[error] socket: -1624267008 connection timed out.: Connection timed out
[error] socket: 1940535040 connection timed out.: Connection timed out
[error] socket: -1876048128 connection timed out.: Connection timed out
[error] socket: -1741764864 connection timed out.: Connection timed out
[error] socket: 2016069376 connection timed out.: Connection timed out
[error] socket: -1615874304 connection timed out.: Connection timed out
[error] socket: -2111043840 connection timed out.: Connection timed out
[error] socket: -2010331392 connection timed out.: Connection timed out
[error] socket: -1842477312 connection timed out.: Connection timed out
[error] socket: -1641052416 connection timed out.: Connection timed out
[error] socket: 1999283968 connection timed out.: Connection timed out
[error] socket: -2144614656 connection timed out.: Connection timed out
[error] socket: -2136221952 connection timed out.: Connection timed out
[error] socket: 2058032896 connection timed out.: Connection timed out
[error] socket: 2083211008 connection timed out.: Connection timed out
[error] socket: -1934797056 connection timed out.: Connection timed out
[error] socket: -1657837824 connection timed out.: Connection timed out
[error] socket: 2024462080 connection timed out.: Connection timed out
[error] socket: -1817299200 connection timed out.: Connection timed out
[error] socket: -2043902208 connection timed out.: Connection timed out
[error] socket: -1783728384 connection timed out.: Connection timed out
[error] socket: -1959975168 connection timed out.: Connection timed out
[error] socket: -1733372160 connection timed out.: Connection timed out
[error] socket: -1632659712 connection timed out.: Connection timed out
[error] socket: 2125174528 connection timed out.: Connection timed out
[error] socket: -1792121088 connection timed out.: Connection timed out
[error] socket: -1708194048 connection timed out.: Connection timed out
[error] socket: -1850870016 connection timed out.: Connection timed out
[error] socket: -1641052416 connection timed out.: Connection timed out
[error] socket: -1951582464 connection timed out.: Connection timed out
[error] socket: -1674623232 connection timed out.: Connection timed out
[error] socket: -1624267008 connection timed out.: Connection timed out
[error] socket: -1590696192 connection timed out.: Connection timed out
[error] socket: -1976760576 connection timed out.: Connection timed out
[alert] socket: -1901226240 select timed out: Connection timed out
[error] socket: -1859262720 connection timed out.: Connection timed out
[error] socket: -1599088896 connection timed out.: Connection timed out
[error] socket: -1876048128 connection timed out.: Connection timed out
[error] socket: -1691408640 connection timed out.: Connection timed out
[error] socket: 2049640192 connection timed out.: Connection timed out
[error] socket: -2001938688 connection timed out.: Connection timed out
[error] socket: 2141959936 connection timed out.: Connection timed out
[error] socket: -1632659712 connection timed out.: Connection timed out
[error] socket: 1982498560 connection timed out.: Connection timed out
[error] socket: 1923749632 connection timed out.: Connection timed out
[error] socket: -1926404352 connection timed out.: Connection timed out
[error] socket: -2069080320 connection timed out.: Connection timed out
[error] socket: 2083211008 connection timed out.: Connection timed out
[error] socket: -1750157568 connection timed out.: Connection timed out
[error] socket: -1783728384 connection timed out.: Connection timed out
[error] socket: -1657837824 connection timed out.: Connection timed out
[error] socket: -1825691904 connection timed out.: Connection timed out
[error] socket: 1890178816 connection timed out.: Connection timed out
[error] socket: -2102651136 connection timed out.: Connection timed out
[error] socket: -2111043840 connection timed out.: Connection timed out
[error] socket: 1906964224 connection timed out.: Connection timed out
[error] socket: -2085865728 connection timed out.: Connection timed out
[error] socket: -1582303488 connection timed out.: Connection timed out
[error] socket: 2074818304 connection timed out.: Connection timed out
[error] socket: 2049640192 connection timed out.: Connection timed out
[error] socket: -1808906496 connection timed out.: Connection timed out
[error] socket: -2077473024 connection timed out.: Connection timed out
[error] socket: -2136221952 connection timed out.: Connection timed out
[error] socket: -2010331392 connection timed out.: Connection timed out
[error] socket: 2041247488 connection timed out.: Connection timed out
[error] socket: -1834084608 connection timed out.: Connection timed out
[error] socket: 1990891264 connection timed out.: Connection timed out
[error] socket: -1708194048 connection timed out.: Connection timed out
[error] socket: -1683015936 connection timed out.: Connection timed out
[error] socket: -2035509504 connection timed out.: Connection timed out
[error] socket: 1940535040 connection timed out.: Connection timed out
[error] socket: -1716586752 connection timed out.: Connection timed out
[error] socket: 2074818304 connection timed out.: Connection timed out
[error] socket: -2102651136 connection timed out.: Connection timed out
[error] socket: -2119436544 connection timed out.: Connection timed out
[error] socket: -1850870016 connection timed out.: Connection timed out
[error] socket: -1968367872 connection timed out.: Connection timed out
[error] socket: -1632659712 connection timed out.: Connection timed out
[error] socket: 1974105856 connection timed out.: Connection timed out
[error] socket: -2094258432 connection timed out.: Connection timed out
[error] socket: -2043902208 connection timed out.: Connection timed out
[error] socket: -1683015936 connection timed out.: Connection timed out
[error] socket: -2077473024 connection timed out.: Connection timed out
[error] socket: -1624267008 connection timed out.: Connection timed out
[error] socket: -1834084608 connection timed out.: Connection timed out
[error] socket: -1993545984 connection timed out.: Connection timed out
[error] socket: 1957320448 connection timed out.: Connection timed out
[error] socket: 2032854784 connection timed out.: Connection timed out
[error] socket: -1724979456 connection timed out.: Connection timed out
[error] socket: 1965713152 connection timed out.: Connection timed out
[error] socket: -1699801344 connection timed out.: Connection timed out
[error] socket: 2116781824 connection timed out.: Connection timed out
[error] socket: 1990891264 connection timed out.: Connection timed out
[error] socket: -2027116800 connection timed out.: Connection timed out
[error] socket: 2133567232 connection timed out.: Connection timed out
[error] socket: 1940535040 connection timed out.: Connection timed out
[error] socket: -1590696192 connection timed out.: Connection timed out
[error] socket: -1943189760 connection timed out.: Connection timed out
[error] socket: 1890178816 connection timed out.: Connection timed out
[error] socket: -1766942976 connection timed out.: Connection timed out
[error] socket: -1867655424 connection timed out.: Connection timed out
[alert] socket: -1901226240 select timed out: Connection timed out
[alert] socket: 1940535040 select timed out: Connection timed out
[error] socket: -1934797056 connection timed out.: Connection timed out
[error] socket: 2032854784 connection timed out.: Connection timed out
[error] socket: -2035509504 connection timed out.: Connection timed out
[error] socket: -2043902208 connection timed out.: Connection timed out
[error] socket: 2083211008 connection timed out.: Connection timed out
[error] socket: -2018724096 connection timed out.: Connection timed out
[error] socket: -1909618944 connection timed out.: Connection timed out
[error] socket: -1825691904 connection timed out.: Connection timed out
[error] socket: -1716586752 connection timed out.: Connection timed out
[error] socket: 2066425600 connection timed out.: Connection timed out
[error] socket: -1959975168 connection timed out.: Connection timed out
[error] socket: 1890178816 connection timed out.: Connection timed out
[error] socket: -1775335680 connection timed out.: Connection timed out
[error] socket: 1965713152 connection timed out.: Connection timed out
[error] socket: -1641052416 connection timed out.: Connection timed out
[error] socket: -1657837824 connection timed out.: Connection timed out
[error] socket: -1590696192 connection timed out.: Connection timed out
[error] socket: -1699801344 connection timed out.: Connection timed out
[error] socket: -1758550272 connection timed out.: Connection timed out
[error] socket: -2001938688 connection timed out.: Connection timed out
[error] socket: -1683015936 connection timed out.: Connection timed out
[error] socket: -1968367872 connection timed out.: Connection timed out
[error] socket: 2141959936 connection timed out.: Connection timed out
[error] socket: -1817299200 connection timed out.: Connection timed out
[error] socket: -1934797056 connection timed out.: Connection timed out
[error] socket: -1976760576 connection timed out.: Connection timed out
[error] socket: -1716586752 connection timed out.: Connection timed out
[error] socket: -2144614656 connection timed out.: Connection timed out
[error] socket: -1876048128 connection timed out.: Connection timed out
[error] socket: -1892833536 connection timed out.: Connection timed out
[error] socket: -1909618944 connection timed out.: Connection timed out
[error] socket: -1817299200 connection timed out.: Connection timed out
[error] socket: 2083211008 connection timed out.: Connection timed out
[error] socket: -2010331392 connection timed out.: Connection timed out
[error] socket: -1867655424 connection timed out.: Connection timed out
[error] socket: -1766942976 connection timed out.: Connection timed out
[error] socket: 2016069376 connection timed out.: Connection timed out
[error] socket: -1674623232 connection timed out.: Connection timed out
[error] socket: 1881786112 connection timed out.: Connection timed out
[error] socket: -1632659712 connection timed out.: Connection timed out
[error] socket: 2099996416 connection timed out.: Connection timed out
[alert] socket: -2102651136 select timed out: Connection timed out
[alert] socket: -1825691904 select timed out: Connection timed out
[error] socket: 1932142336 connection timed out.: Connection timed out
[error] socket: -1758550272 connection timed out.: Connection timed out
[error] socket: 2007676672 connection timed out.: Connection timed out
[error] socket: -1783728384 connection timed out.: Connection timed out
[error] socket: -1624267008 connection timed out.: Connection timed out
[error] socket: -1867655424 connection timed out.: Connection timed out
[error] socket: -1733372160 connection timed out.: Connection timed out
[error] socket: -1934797056 connection timed out.: Connection timed out
      done.

Transactions:		       99685 hits
Availability:		       99.69 %
Elapsed time:		     2622.49 secs
Data transferred:	      488.64 MB
Response time:		        2.10 secs
Transaction rate:	       38.01 trans/sec
Throughput:		        0.19 MB/sec
Concurrency:		       79.69
Successful transactions:       99685
Failed transactions:	         315
Longest transaction:	       69.90
Shortest transaction:	        0.07
 
FILE: /var/log/siege.log
You can disable this annoying message by editing
the .siegerc file in your home directory; change
the directive 'show-logfile' to false.